Terraform plan for __production__
<details>
  <summary>Plan: 3 to add, 3 to change, 3 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.broker_aws.cloudfoundry_app.ssb will be updated in-place
  ~ resource "cloudfoundry_app" "ssb" {
        id                         = "62384acd-6280-41e4-aa82-5892090542ac"
      ~ id_bg                      = "************************************" -> (known after apply)
        name                       = "ssb-aws"
      ~ source_code_hash           = "jDnsF3nzE8ih8Cp/CFLPXfftHJwdOtSBbIQN1u5Regs=" -> "bafQGpX33Ss7OapvwDvDu621bvuiNyMEUhRNs6DQ3xM="
        # (18 unchanged attributes hidden)


      ~ service_binding {
          ~ service_instance = "71967b12-e5c4-42c3-ab47-a01ab46fdd81" -> (known after apply)
            # (1 unchanged attribute hidden)
        }
        # (1 unchanged block hidden)
    }

  # module.broker_aws.cloudfoundry_service_instance.db must be replaced
-/+ resource "cloudfoundry_service_instance" "db" {
      ~ id                             = "************************************" -> (known after apply)
        name                           = "ssb-aws-db"
      ~ replace_on_service_plan_change = false -> true
      ~ service_plan                   = "3a8e624f-ba5a-4435-8fa4-ee955b103bae" -> "4b9e5bb1-d0d3-4c24-8542-e377cbb85aed" # forces replacement
        tags                           = [
            "mysql",
        ]
        # (3 unchanged attributes hidden)
    }

  # module.broker_eks.cloudfoundry_app.ssb will be updated in-place
  ~ resource "cloudfoundry_app" "ssb" {
        id                         = "bcd8860e-197c-47e9-b9db-14e77ba3d0cd"
      ~ id_bg                      = "************************************" -> (known after apply)
        name                       = "ssb-eks"
      ~ source_code_hash           = "0wt4Cit5VGBMPnBmVcrceFdYw5LoJAw9y9s/eKp/15E=" -> "tK94+/da+/fYULqmF7N/pZI9+KuwS83ZqN0R5x4H1iE="
        # (18 unchanged attributes hidden)


      ~ service_binding {
          ~ service_instance = "95bdeb55-c667-4821-a269-da7d92be6337" -> (known after apply)
            # (1 unchanged attribute hidden)
        }
        # (1 unchanged block hidden)
    }

  # module.broker_eks.cloudfoundry_service_instance.db must be replaced
-/+ resource "cloudfoundry_service_instance" "db" {
      ~ id                             = "************************************" -> (known after apply)
        name                           = "ssb-eks-db"
      ~ replace_on_service_plan_change = false -> true
      ~ service_plan                   = "3a8e624f-ba5a-4435-8fa4-ee955b103bae" -> "4b9e5bb1-d0d3-4c24-8542-e377cbb85aed" # forces replacement
        tags                           = [
            "mysql",
        ]
        # (3 unchanged attributes hidden)
    }

  # module.broker_solr.cloudfoundry_app.ssb will be updated in-place
  ~ resource "cloudfoundry_app" "ssb" {
        id                         = "f66ae407-1588-4b03-b2da-3600aab5d6ab"
      ~ id_bg                      = "************************************" -> (known after apply)
        name                       = "ssb-solr"
        # (19 unchanged attributes hidden)


      ~ service_binding {
          ~ service_instance = "3c73e801-d72e-4c60-aec7-26a29edab9dc" -> (known after apply)
            # (1 unchanged attribute hidden)
        }
        # (2 unchanged blocks hidden)
    }

  # module.broker_solr.cloudfoundry_service_instance.db must be replaced
-/+ resource "cloudfoundry_service_instance" "db" {
      ~ id                             = "************************************" -> (known after apply)
        name                           = "ssb-solr-db"
      + replace_on_params_change       = false
      + replace_on_service_plan_change = true
      ~ service_plan                   = "3a8e624f-ba5a-4435-8fa4-ee955b103bae" -> "4b9e5bb1-d0d3-4c24-8542-e377cbb85aed" # forces replacement
        tags                           = [
            "mysql",
        ]
        # (2 unchanged attributes hidden)
    }

Plan: 3 to add, 3 to change, 3 to destroy.
```
</details>

Plan generated in [plan #93](https://github.com/GSA/datagov-ssb/actions/runs/926542108)